<!DOCTYPE HTML>

<html lang="es">

<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <title>Interactive Fiction Mapper</title>
    <style>

	.center {
	    text-align: center;
	}

	.title {
	    color: #000080;
	    font-size: 1.5em;
	    font-weight: bold;
	}

	.subtitle {
	    color: #000080;
	    font-size: 1.13em;
	    font-weight: bold;
	    text-decoration: underline;
	}

	.heading1 {
	    color: #000080;
	    font-size: 1.5em;
	    font-weight: bold;
	}

	.heading2 {
	    color: #000000;
	    font-size: 1.13em;
	    font-weight: bold;
	}

	.imageborder {
	    border: 5px solid;
	}

	.imagealignright {
	    float: right;
	}

    </style>
</head>


<body>

    <p class="center title">
	<u>Interactive Fiction Mapper (IFMapper)</u><br>
	by Gonzalo Garramu&ntilde;o
    </p>
    <p class="center subtitle">
	User's Manual
    </p>

    <ol>
	<li><a href="#Introduction">Introducci&oacute;n</a>
	    <ul>
		<li>
		    <a href="#WhatAreInteractiveFictionGames">Qu&eacute; son los Juegos de Ficci&oacute;n
		      Interactiva?</a>
		</li>
		<li>
		  <a href="#WhatIsIFMapper">Qu&eacute; es IFMapper?</a>
		</li>

		<li><a href="#FeaturesOfIFMapper">Caracter&iacute;sticas de IFMapper</a><br>
		  &nbsp;
		</li>
	    </ul>
	</li>
	<li><a href="#Installation">Instalaci&oacute;n</a>
	  <ul>
	    <li><a href="#WhatYou'llNeed">Lo que necesitar&aacute;s</a>
	    </li>
	    <li>
	      <a href="#Windows">Microsoft Windows</a>
	    </li>
	    <li>
	      <a href="#macOS">Apple macOS</a>
	    </li>
	    <li>
	      <a href="#LinuxOrUNIX">Linux or UNIX</a>
	    </li>
	    <li>
	      <a href="#Upgrading">Actualizando</a><br>
	      &nbsp;
	    </li>
	  </ul>
	</li>
	<li>
	  <a href="#StartingIFMapper">Arrancando IFMapper</a>
	  &nbsp;
	</li>
	<li>
	  <a href="#UsingIFMapper">Usando IFMapper</a>
	  <ul>
	    <li>
	      <a href="#TheInterface">La Interfaz Gr&aacute;fica</a>
	    </li>
	    <li>
	      <a href="#Navigation">Navegaci&oacute;n</a>
	    </li>
	    <li>
	      <a href="#CreatingLocations">Creando Localidades</a>
	    </li>
	    <li>
	      <a href="#CreatingConnections">Creando Conexiones</a>
	    </li>
	    <li>
	      <a href="#DeletingRoomsOrConnections">Borrando Localidades y Conexiones</a>
	    </li>
	    <li>
	      <a href="#ComplexConnections">Creando Conexiones Complejas</a>
	    </li>
	    <li>
	      <a href="#MovingRoomsInMap">Moviendo Localidades</a>
	    </li>
	    <li>
	      <a href="#DealingWithMultipleSections">Trabajando con M&uacute;ltiples Secciones</a>
	    </li>
	    <li>
	      <a href="#Buscando">Buscando</a>
	    </li>
	    <li>
	      <a href="#Preferences">Preferencias</a>
	    </li>
	    <li>
	      <a href="#SavingAndLoadingMaps">Grabando y Cargando Mapas</a>
	    </li>
	    <li>
	      <a href="#LockingMaps">Clausurando Mapas</a>
	    </li>
	    <li>
	      <a href="#MappingGamesFromTranscripts(Automapping)">Creando Mapas Autom&aacute;ticamente desde Transcripciones (Mapeado Autom&aacute;tico)</a>
	      <ul>
		<li>
		  <a href="#HowDoesTheAutomapperDistinguishLocations">C&oacute;mo funciona el Mapeado Autom&aacute;tico</a>
		</li>
		<li>
		  <a href="#LimitationsOnAutomapping">Limitaciones del Mapeado Autom&aacute;tico</a>
		</li>
	      </ul>
	    </li>
	    <li>
	      <a href="#ExportingToSVG">Exportando Mapas a Formato Scalable Vector Graphics (SVG)</a><br>
	      &nbsp;
	    </li>
	  </ul>
	<li>
	  <a href="#CreatingANewInform/TADS3Game">Creando un nuevo juego para TADS3 o Inform</a>
	  &nbsp;
	</li>

	<li><a href="#Appendix">Ap&eacute;ndices</a>
	  <ul>
	    <li>
	      <a href="#IAmNewToInteractiveFiction.WhatGamesWouldYouRecommend?">Soy nuevo en esto de la Ficci&oacute;n Interactiva.&nbsp; &iquest;Qu&eacute; juegos me recomend&aacute;s?</a>
	    </li>
	    <li>
	      <a href="#ContactingTheAuthor">Contactando al Autor</a>
	    </li>
	  </ul>
	</li>
    </ol>


    <p>&nbsp;</p>

    <p id="Introduction" class="heading1">
      Introducci&oacute;n
    </p>

    <p id="WhatAreInteractiveFictionGames" class="heading2">
      &iquest;Qu&eacute; son los Juegos de Ficci&oacute;n Interactiva?
    </p>

    <p>Son juegos de aventuras, que usualmente contienen poco o nada de gr&aacute;ficos pero usan prosa para describir localidades, eventos y, con suerte, una buena historia. El primer juego de ficci&oacute;n interactiva fue creado a finales de 1970 y se lo conoce como <i>Adventure</i> (o <i>Colossal Cave</i>), si bien el g&eacute;nero reci&eacute;n se convirti&oacute; en popular y desarroll&oacute; la mayor&iacute;a de sus convenciones con la creaci&oacute;n de Infocom en los a&ntilde;os 80.<br>

Si nunca han jugado un juego de ficci&oacute;n interactiva, tal vez la mejor
comparaci&oacute;n es que son una versi&oacute;n m&aacute;s adulta de &ldquo;Calabozos y Dragones&rdquo; o de
los libros infantiles de &ldquo;Elige tu Propia Aventura&rdquo;.<br>

Como las novelas, la ficci&oacute;n interactiva ha evolucionado hacia diferentes
estilos, g&eacute;neros y niveles de interactividad.
Hoy por hoy pueden encontrarse aventuras desarrolladas en idiomas como Ingl&eacute;s, Espa&ntilde;ol, Italiano, Alem&aacute;n, etc.<br>

      Vea la secci&oacute;n: <a href="#IAmNewToInteractiveFiction.WhatGamesWouldYouRecommend?">Soy nuevo en esto de la Ficci&oacute;n Interactiva. &iquest;Qu&eacute; juegos me recomend&aacute;s?</a>
    </p>


    <p id="WhatIsIFMapper" class="heading2">
      &iquest;Qu&eacute; es IFMapper?
    </p>

    <p>
      IFMapper es una herramienta para ayudar con el mapeo
      de los juegos de ficci&oacute;n interactiva.&nbsp; Como estos juegos dependen principalmente de descripciones textuales y por lo general usan los puntos
cardinales para navegar por el juego, es relativamente f&aacute;cil perderse.&nbsp; En los viejos tiempos, los jugadores usaban papel cuadriculado para dibujar sus mapas, usando rect&aacute;ngulos y l&iacute;neas para mostrar cada localidad y sus salidas.&nbsp; IFMapper es b&aacute;sicamente, la versi&oacute;n del siglo 21 de esa misma pr&aacute;ctica.<br>

      Aunque IFMapper es principalmente una herramienta de
      mapeo, puede ser tambi&eacute;n utilizada como herramienta de dise&ntilde;o en las primeras
      etapas de desarrollo de nuevos juegos (para los lenguajes de aventuras Inform o TADS3).
    </p>


    <p id="FeaturesOfIFMapper" class="heading2">
	Caracter&iacute;sticas de IFMapper
    </p>
    <ul>
      <li>Multi-plataforma (Windows, Linux, OSX)</li>
      <li>Interfaz gr&aacute;fica simple</li>
      <li>Conexiones Complejas (conexiones que vuelven sobre s&iacute; mismas o conectan dos localidades remotas)</li>
      <li>Conexi&oacute;n de localidades remotas usando un algoritmo A*</li>
      <li>Soporte de la rueda del rat&oacute;n para acercarse o alejarse del mapa</li>
      <li>Paneo del mapa usando el bot&oacute;n medio del rat&oacute;n</li>
      <li>Localidades pueden listar objetos y tareas.</li>
      <li>Numeraci&oacute;n autom&aacute;tica de las localidades.</li>
      <li>Edici&oacute;n de m&uacute;ltiples mapas en simult&aacute;neo.</li>
      <li>Facilidad para mover localidades con las flechas del teclado</li>
      <li>Escrito en un lenguaje de simple y bueno (Ruby)</li>
      <li>Impresi&oacute;n a Acrobat PDF</li>
      <li>Puede leer y grabar archivos IFM</li>
      <li>Puede leer y grabar archivos de c&oacute;digo fuente de Inform/TADS3</li>
      <li>Los mapas pueden ser clausurados para evitar su modificaci&oacute;n por error</li>
      <li>B&uacute;squeda interactive de palabras en localidades, objetos o
	tareas
      </li>
      <li>Puede mapear juegos autom&aacute;ticamente desde transcripciones similares a las de Infocom, aun cuando est&aacute;s jugando.
      </li>
      <li>Gratis y Open Source</li>
    </ul>


    <p>&nbsp;</p>

    <p id="Installation" class="heading1">
	Instalaci&oacute;n
    </p>

    <p id="WhatYou'llNeed" class="heading2">
      Lo que necesitar&aacute;s
    </p>


    <p>
      Para usar IFMapper, necesit&aacute;s
      tener el language de programaci&oacute;n <a href="https://www.ruby-lang.org">Ruby</a> instalado (al menos v2.0) y <a href="https://github.com/larskanis/fxruby">FXRuby</a> (al menos v1.6).&nbsp;<br>

      Para imprimir documentos PDF, necesitar&aacute;s el <a href="https://rubygems.org/gems/pdf-writer">m&oacute;dulo PDF::Writer de Austin Ziegler.</a>
    </p>

    <p id="Windows" class="heading2">
	Microsoft Windows
    </p>
    <p>
      Baje y corra la última versión recomendada de 64-bits de
      <a href="https://rubyinstaller.org">RubyInstaller</a> para Windows para instalar Ruby y el MSYS2 Devkit, acceptando todas las opciones por defecto, siguiendo las instrucciones aquí:<br>
	<br>
	<a href="https://rubyinstaller.org/downloads/">https://rubyinstaller.org/downloads/</a><br>
	<br>
	Una vez que la instalación ha completado, cliquée en la nueva entrada en el menu de Start llamada <b>Start Command Prompt with Ruby</b>, e instale IFMapper con RubyGems:<br>
	<br>
	<code>gem install ifmapper</code><br>
	<br>
	Esto bajará e instalará la ultima versión de IFMapper, junto con todas las otras dependencias requeridas, y las instalará como gemas dentro del directorio de instalación de Ruby, e.j:<br>
	<br>
	<code>C:\Ruby{RUBY_VERSION}-x64\lib\ruby\gems\{RUBY_VERSION}\gems\ifmapper-{VERSION}</code><br>
	<br>
    </p>
    <p id="macOS" class="heading2">
	Apple macOS
    </p>
    <p>
	macOS incluye Ruby por defecto pero la gema de FXRuby gem requerida y su dependencia en el toolkit de FOX, puede no ser tan fácil de instalar.
	Herramientas y bibliotecas de desarrollador pueden ser requeridas y puede que necesites intalar <a href="https://brew.sh">Homebrew</a>, para compilar el toolkit de FOX.
	El <a href="https://www.xquartz.org">XQuartz</a> X sistema de ventanas eserá requerido para mostrar IFMapper.
	Homebrew puede ser usado para instalar Ruby también.  Una vez que todas las dependencias son satisfechas, IFMapper debería instalarse con RubyGems:<br>
	<br>
	<code>sudo gem install ifmapper</code><br>
	<br>
    </p>

    <p id="LinuxOrUNIX" class="heading2">
	Linux or UNIX
    </p>
    <p>
	Deberás obtener Ruby de los repositorios de paquetes de tu sistema operativo.<br>
	<br>
	Por ejemplo, usando apt-get:<br>
	<br>
	<code>sudo apt-get install ruby</code><br>
	<br>
	Nótese que es probable que además tengas que instalar el toolkit de Fox, así como las herramientas de compilación, desde tu repositorio de paquetes, de la misma forma que instalaste ruby.
	<br>
	<br>
	<code>sudo apt-get install build-essential libfox-1.6-dev</code><br>
	<br>
	Después que tengas a ruby corriendo, instala IFMapper y sus dependencias con RubyGems:<br>
	<br>
	<code>sudo gem install ifmapper</code><br>
	<br>
	Esto debería bajar e instalar la última versión de IFMapper, junto con todas sus dependencias requeridas, e instalarlas como gems en, e.g:<br>
	<br>
	<code>/usr/local/lib/ruby/gems/{RUBY_VERSION}/gems/ifmapper-{VERSION}</code><br>
	<br>
	<br>
    </p>
    <p id="Upgrading" class="heading2">
	Actualizando
    </p>
    <p>
	Incluído con Ruby, <a href="https://rubygems.org">RubyGems</a> maneja las bibliotecas de Ruby - puede instalar y actualizar cualquier dependencia que IFMapper necesite.<br>
	<br>
	Una vez que IFMapper está instalado por RubyGems, usted puede actualizarlo a la ultima version corriendo este comando:<br>
	<br>
	<code>gem update --conservative --minimal-deps ifmapper</code><br>
	<br>
	Si existe una nueva versi&oacute; de IFMapper, ser&aacute; actualizada junto con cualquier biblioteca requerida, que resultar&aacute en la versión de la gema siendo actualizada en el directorio de instalación de la misma, como:<br>
	<br>
	<code>/usr/local/lib/ruby/gems/{RUBY_VERSION}/gems/ifmapper-{VERSION}</code>
    </p>


    <p>&nbsp;</p>

    <p id="StartingIFMapper" class="heading1">
      Arrancando IFMapper
    </p>
    <p>Una vez instalado, puedes correr IFMapper ya sea cliqueando con el <b>Botón Izquierdo del Rat&oacute;n</b> sobre el archivo IFMapper.rbw dentro del directorio de ifmapper o, invocando IFMapper.rbw desde cualquier shell o consola.  Por ejemplo:<br>
	<br>
	<code>/usr/local/lib/ruby/gems/{RUBY_VERSION}/gems/ifmapper-{VERSION}/IFMapper.rbw</code><br>
	<br>
    </p>
    <p>Asumiendo que todo est&aacute; instalado correctamente, ver&aacute;s
      la pantalla principal de IFMapper con un mapa vac&iacute;o.&nbsp;
    </p>

    <p>&nbsp;</p>

    <p id="UsingIFMapper" class="heading1">
	Usando IFMapper
    </p>

    <p id="TheInterface" class="heading2">
      La Interfaz Gr&aacute;fica
    </p>


    <p>
      <img src="../images/IFMapper_main.gif" border="0" height="600" width="800" alt="IFMapper main user interface"></p>
    <p>La interfaz de IFMapper consiste de un menu que permite acceder a operaciones comunes (cargar/grabar mapas, cambiar seteos, etc), una barra de herramientas con funcionalidad similar, y una o m&aacute;s ventanas mostrando una p&aacute;gina de un mapa.</p>

<p>IFMapper te permite editar multiples
mapas simult&aacute;neamente.<br>

Cada mapa puede tener varias &ldquo;secciones&rdquo;, para as&iacute; mantener diferentes partes o
cap&iacute;tulos de los juegos organizados.<br>

Note que estas secciones tienen poco que ver como se hace la impresi&oacute;n del mapa
ya que dos secciones pueden terminar impresas juntas si entran en una p&aacute;gina o
una secci&oacute;n puede pasar a estar dividida en m&uacute;ltiples p&aacute;ginas por su tama&ntilde;o.</p>


<p>Cuando arranques IFMapper por primera vez, ver&aacute;s
un mapa vac&iacute;o que muestra una grilla donde las localidades y las conexiones
pueden ser creadas.
&nbsp;</p>


    <p id="Navigation" class="heading2">
      Navegaci&oacute;n
    </p>


    <p>Use su rat&oacute;n para la navegaci&oacute;n. Si su rat&oacute;n soporta una rueda giratoria, &eacute;sta puede ser usada para acercarse o alejarse del mapa f&aacute;cilmente.<br>

Para panear alrededor del mapa, use el <b>Bot&oacute;n Medio del Rat&oacute;n</b> o, alternativamente, <b>ALT + El Bot&oacute;n Izquierdo del Rat&oacute;n</b>
(Estas teclas imitan el funcionamiento de <i>Maya</i> y <i>3D Studio Max</i>, ambos softwares populares de 3d).&nbsp; Puedes tambi&eacute;n moverte
por el mapa usando las barras de scroll que se encuentran en los bordes del mapa.</p>



    <p id="CreatingLocations" class="heading2">
      Creando Localidades
    </p>
    <p>
      <img class="imagealignright" src="../images/room_small.gif" width="342" height="377" alt="IFMapper Location/Room Information requester">
</b>Puedes crear localidades en el mapa simplemente cliqueando
en cualquiera de los rect&aacute;ngulos de gu&iacute;a. La nueva localidad ser&aacute; otorgada un
nombre b&aacute;sico (&lsquo;Nueva Localidad&rsquo;) y estar&aacute; vac&iacute;a.<br>

Cada localidad agregada recibe autom&aacute;ticamente un n&uacute;mero, basado en su orden de creaci&oacute;n.<br>

Para modificar el nombre o propiedades de una localidad, puedes cliquear dos veces sobre ella y una caja de datos aparecer&aacute;
para permitirte hacerlo.<br>

Si quieres que dicha caja de datos aparezca tan pronto como crees una nueva
localidad, puedes activar <b>Mapa-&gt;Opciones-&gt;Editar al Crear</b>.<br>


Esta caja de edici&oacute;n de localidades tiene opciones para marcar el cuarto
como oscuro y para agregar una lista de objetos presentes en la habitaci&oacute;n.<br>

A medida que juegas un juego, puede que quieras tambi&eacute;n listar las acciones que necesitas realizar en la localidad para progresar en el juego (proveyendo as&iacute; de un sistema rudimentario de ayuda o soluci&oacute;n para el juego).<br>

La caja de edici&oacute;n puede ser dejada abierta para r&aacute;pidamente editar varias localidades.<br>


<br>Adem&aacute;s de usar el rat&oacuten, puedes usar el teclado
num&eacute;rico con la tecla de <b>Bloque Num&eacute;rico</b> (Num Lock) activado y as&iacute; usar los n&uacute;meros del <b>1 al 9</b> para
crear una nueva localidad en la direcci&oacute;n apropiada.&nbsp;<br>
<br>


    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p id="CreatingConnections" class="heading2">
      Creando Conexiones
    </p>
    <p>Puedes crear conexiones entre localidades cliqueando
      en las areas alrededor de los rect&aacute;ngulos del mapa. Dependiendo
      de d&oacute;nde exactamente cliquees, una conexi&oacute;n simple ser&aacute; creada entre ambas localidades.<br>
      <br>
      En su configuraci&oacute;n de comienzo, puedes cliquear para
      crear una conexi&oacute;n en un &aacute;rea del mapa donde no existan a&uacute;n localidades. IFMapper proceder&aacute; a crear las localidades faltantes
      autom&aacute;ticamente, adem&aacute;s de la conexi&oacute;n.<br>

      <br>

      Note que puede cambiar el comportamiento de c&oacute;mo las localidades y las conexiones son creadas desde el men&uacute; de <b>Mapa-&gt;Opciones</b>:<br>

      <b>Conexi&oacute;n Autom&aacute;tica - </b>crer&aacute; una conexi&oacute;n a la localidad previa desde cada nueva localidad que crees.<br>
      <b>Crear al Conectar &ndash; </b>te permitir&aacute; agregar tanto la conexi&oacute;n como las localidades faltantes cuando cliqu&eacute;es en un &aacute;rea de conexi&oacute;n en el mapa.<br>

      <br>
      <img class="imagealignright" src="../images/connection.gif" height="118" width="332" alt="IFMapper Connection requester">
      <br>

      Las conexiones pueden ser tambi&eacute;n modificadas en forma similar a las localidades, cliqueando dos veces sobre una de ellas.
      <br>

      La caja de datos de la conexi&oacute;n te permite especificar la conexi&oacute;n como una conexi&oacute;n libre, como una puerta, como una puerta con llave o como una conexi&oacute;n especial.&nbsp; <br>
      <br>
      Tambi&eacute;n te permite hacer que la conexion sea unidireccional o en ambas direcciones.&nbsp; Finalmente, puedes agregar texto en las conexiones para indicar Subir/Bajar o Entrar/Salir.<br>
      <br>
      <img class="imagealignright imageborder" src="../images/connection_menu.gif" width="342" height="241" alt="IFMapper Connection menu">
      <br>
      Hacer que la conexi&oacute;n sea unidireccional puede hacerse tambi&eacute;n cliqueando sobre ella varias veces en sucesi&oacute;n, sin necesidad de abrir la caja de edici&oacute;n.
      <br>
      <br>

      Finalmente, seleccionando una conexi&oacute;n y usando el <b>Bot&oacute;n Derecho del Rat&oacute;n</b> te permite acceder a un menu que te permite invertir la conexi&oacute; o trasladar la conexi&oacute;n hacia otra salida de una
de las localidades.</p>

    <p id="DeletingRoomsOrConnections" class="heading2">
      Borrando Localidades o Conexiones
    </p>
    <p>
      Para borrar una localidad o conexion, selecci&oacute;nela primero.
      Luego, presione la tecla de borrado ( <b>Supr</b> o <b>Delete</b> o <b>Backspace</b> ).<br>

      Note que por ahora no hay un comando de Deshacer (Undo), por lo que las habitaciones o conexiones borradas no pueden recuperarse.<br>

<br>

    <p id="ComplexConnections">
      Conexiones Complejas
      <img class="imagealignright imageborder" src="../images/complex_connection.gif" align="right" border="5" height="308" width="338">
    </p>
    <p>

      Muchas aventuras de texto tienen laberintos con salidas que no llevan a ning&uacute;n lado y salidas que cambian su direcci&oacute;n de una localidad a otra. Nos referimos a estas conexiones como conexiones complejas.<br>

      Para crear conexiones complejas, tipee la letra <b>'x'</b>
      o use la funci&oacute;n del men&uacute;
      <b>Edit-&gt;Agregar Conexi&oacute;n Compleja</b>. Luego, cliquee en una salida de la primera localidad a conectar y luego en la salida de la segunda localidad.<br>
      Si quiere salir del modo de agregar una connexion compleja, puede presionar la tecla de <b>ESC</b> en cualquier momento. <br>

      IFMapper intentar&aacute; calcular el camino en el mapa
      que te lleva desde la salida de la primera localidad a la salida de la segunda.
      <br>
      Para que una conexi&oacute;n compleja ocurra, el camino entre ambas localidades debe estar &lsquo;libre&rsquo; de otras localidades que se interpongan. IFMapper tambi&eacute;n tratar&aacute; de evitar que diversos caminos complejos se crucen, pero a&uacute;n as&iacute; lo permitir&aacute;.<br>
      <br>
      Para crear salidas que no van a ning&uacute;n lado (en loop), puedes crear una connexion compleja cliqueando <b>CTRL + Bot&oacute;n Izquierdo del Rat&oacute;n</b>, sin necesidad de ir al modo de Conexi&oactue;n Compleja.
      <br>
    </p>

    <p id="MovingRoomsInMap" class="heading2">
      Moviendo Localidades en el Map
    </p>

    <p>

      Cuando construyas mapas grandes de juegos complejos, probablemente te encontrar&aacute;s en la necesidad de mover las localidades. Para hacerlo, selecciona las localidades que quieras mover usando  <b>CTRL+Bot&oacute;n Izquierdo del Rat&oacute;n </b>sobre ellas, y luego usa las teclas de las flechas del cursor para mover las habitaciones una unidad de grilla a la vez.<br>

Puedes usar tambi&eacute;n <b>SHIFT+Bot&oacute;n Izquierdo del Rat&oacute;n</b> y mantenerlo apretado para dibujar una caja alrededor de varias localidades a seleccionar. <br>

      Si hay conexiones entre las localidades que moves y
      las que no, IFMapper seguir&aacute; recalculando nuevos
      caminos para las conexiones a medida que mov&eacute;s las
      habitaciones.<br>

      Note que las conexiones complejas pueden a veces &ldquo;fallar&rdquo; debido a quedar
      bloqueadas. En esos cases, ver&aacute;s que la conexi&oacute;n queda r&iacute;gida y se vuelve roja.<br>
    </p>


    <p id="DealingwithMultipleSections" class="heading2">
      Trabajando con M&uacute;ltiples Secciones
    </p>
    <p>
      Algunos juegos de aventuras pueden ser bien grandes y estar divididos en cap&iacute;tulos.&nbsp;
      En esos casos, puede que quieras aprovechar la opci&oacute;n de IFMapper
      de crear varias secciones del mapa.&nbsp; Esto mantendr&aacute; a tu mapa organizado y puede que te ayude a imprimirlo m&aacute;s tarde.<br>
      <br>
      Puedes crear o borrar secciones desde los menus de <b>Mapa</b><b>-&gt;Secciones-&gt;Crear Secci&oacute;n</b> y <b>Mapa-&gt;Secciones-&gt;Borrar Secci&oacute;n.</b><br>
      <br>
      Para moverte de una secci&oacute;n a otra, puedes usar las flechas localizadas en la parte derecha de la barra de herramientas o las opciones del men&uacute; der <b>Mapa-&gt;Secciones-&gt;Pr&oacute;xima/Previa Secci&oacute;n</b>.
      <br>
      <br>
    </p>


    <p id="Searching" class="heading2">
      Buscando
    </p>
    <p>
      Puedes buscar palabras en las localidades, lista de objetos, tareas o
descripciones de la secci&oacute;n activa o en todo el mapa, usando el pseudo lenguaje llamado &ldquo;expresiones regulares&rdquo;.<br>

La b&uacute;squeda es interactiva, como en <i>Emacs</i>, lo que
significa que mientras escribes, las localidades que tienen una coincidencia se
seleccionan autom&aacute;ticamente.<br>

El n&uacute;mero de coincidencias para el mapa y la secci&oacute;n se muestra en la barra de estatus.<br>

Puedes usar los botones de Pr&oacute;xima/Previa Coincidencia para centrar la vista del mapa sobre cada localidad que coincide (y autom&aacute;ticamente cambiar de secci&oacute;n si est&aacute;s buscando cosas en todo el mapa).<br>
      <br>
    </p>

    <p id="Preferences" class="heading2">
       Preferencias
    </p>
    <p>
      IFMapper te permite cambiar y setear las preferencias para cada mapa (colores, opciones de edici&oacute;n, etc). Puedes grabar tus preferencias para que as&iacute; IFMapper arranque con esos seteos al crear mapas nuevos.<br>
      <br>
    </p>

    <p id="SavingAndLoadingMaps" class="heading2">
      Grabando y Cargando Mapas
    </p>

    <p>
    Para grabar un mapa que est&aacute;s editando, puedes ir a <b>Archivo-&gt;Grabar</b> o <b>Archivo-&gt;Grabar Como</b>.&nbsp; El formato propio de los mapas de IFMapper es el formato .map, que es un archivo binario.  Este formato graba todas las preferencias de tu mapa asi como todas las conexiones y descripciones de las localidades.<br>

    Para cargar un mapa, puedes usar <b>Archivo-&gt;Abrir</b>.
    Adem&aacute;s del formato propio de IFMapper, el software tambi&eacute;n soporta otros formatos populares de la comunidad de Ficci&oacute;n Interactiva. IFMapper puede leer:<br>

    - .ifm files (Dave Chapeski's <i>IFM</i>, una popular y gratis herramienta de mapeo y soluciones de Unix)<br>
    - .gmp file (<i>GUEmap</i>'s maps, a shareware (v1) / open source (v2) herramienta de mapeo de Windows)<br>
    - .inf files (<i>Inform 6</i> archivos de codigo fuente)<br>
    - .inform files (<i>Inform 7</i> archivos de codigo fuente)<br>
    - .trizbort files (<i>Trizbort</i> archivos de mapas)<br>
    - .t3m or .t files (<i>TADS 3</i> makefiles o archivos de codigo fuente)<br>
    <br>
    </p>
    <p id="LockingMaps" class="heading2">
      Clausurando Mapas
    </p>
    <p>
      Una vez que termines una aventura, puedes clausurar el mapa para su distribuci&oacute;n.<br>

      Puedes hacerlo llendo a <b>Mapa-&gt;Datos del Mapa</b>
      y cliqueando en el switch de Lectura Solamente y luego asegurarse de grabar el mapa como archivo .map (El formato nativo de IFMapper).<br>

      Hacer que el mapa sea de lectura solamente no te permitir&aacute; editar el mapa (y as&iacute; prevendr&aacute;s accidentalmente mover o cambiar las descripciones de las localidades por error).<br>

      Cuando se lee un archivo IFM, el modo de Lectura Solamente se activa autom&aacute;ticamente, ya que se asume que estos mapas fueron creados y finalizados con otro software.
      Si necesitas modificarlos, desactive el modo de Lectura Solamente en el panel de Datos del Mapa.<br>
      <br>
    </p>

    <p id="MappingGamesFromTranscripts(Automapping)" class="heading2">
      Mapeando Juegos desde sus Transcripciones (Mapeo Autom&aacute;tico)
    </p>
    <p>
      La forma en que el mapeo autom&aacute;tico funciona es que leer&aacute; un archivo de transcripci&oacute;n o bit&aacute;cora de tu juego, e intentar&aacute; interpretarlo para generar localidades y conexiones (&iexcl;a&uacute;n cuando est&aacute;s todav&iacute;a jugando al juego!).<br>
      <br>
      Para usar el mapeo autom&aacute;tico, ve a tu juego y comienza una transcripci&oacute;n.  Usualmente esto se hace con:<br>
      <br>
      <b>&gt; verbose</b><br>
      <b>&gt; script</b><br>
      <br>
      y luego especificando el nombre del archivo.<br>
      <br>
      <img class="imagealignright" src="../images/automap.gif" width="413" height="428" alt="IFMapper Transcript Options requester">
      Luego, ve al IFMapper y en un mapa (usualmente uno
vac&iacute;o) corre: <b>Mapa-&gt;Mapeo Autom&aacute;tico-&gt;Comenzar</b>.
<br>Esto abrir&aacute; una ventana donde debes indicar a IFMapper
el nombre de tu archivo de transcripci&oacute;n.<br>
Luego, se abrir&aacute; una ventana de opciones.<br>
Las opciones permiten indicar c&oacute;mo se va a identificar cada localidad como &uacute;nica.
El mapeo autom&aacute;tico puede determinar si est&aacute;s en una nueva localidad ya sea comparando la descripci&oacute;n del lugar (lo est&aacute;ndar) o comparando s&oacute;lo el encabezado de la localidad. Juegos que tienen
localidades con encabezados repetidos (usualmente, laberintos) se beneficiar&aacute;n de ser identificados por su descripci&oacute;n mientras juegos que cambian la descripci&oacute;n de las localidades frecuentemente o tras varias visitas puede que se mapeen mejor usando s&oacute;lo los encabezados. N&oacute;tese que pod&eacute;s cambiar de un modo a otro en cualquier momento del juego.<br>

Otra opci&oacute;n te permite indicar de qu&eacute; tipo de transcripci&oacute;n
se trata.  La mayor&iacute;a de juegos utilizan el formato Cl&aacute;sico aunque algunos juegos viejos de Infocom (<i>Witness</i> y <i>Moonmist</i>) tienen su propio formato.
<br>

Y eso es todo.  Inmediatamente, deber&iacute;as ver a IFMapper trabajar y comenzar a crear localidades y conexiones. <br>

Si contin&uacute;as jugando al juego y el comando de transcripci&oacute;n
permanence activo, IFMapper continuar&aacute; mapeando el juego en forma interactiva.<br>

Esto funciona muy bien para juegos que corren bajo <i>WinFrotz</i>,
por ejemplo, aunque otros int&eacute;rpretes no agregan el texto al archivo de transcripci&oacute;n en forma inmediata, lo que lleva a un mapeado menos interactivo (con esos int&eacute;rpretes, probablemente debas tipear varios comandos antes de que el archivo de transcripci&oacute;n sea actualizado).<br>
Adem&aacute;s de intentar extraer las localidades y tus movimientos, el mapeo autom&aacute;tico tambi&eacute;n intentar&aacute; extraer los objetos visibles en cada habitaci&oacute;n, a trav&eacute;s del monitoreo de tus commandos de &lsquo;get&rsquo; o &lsquo;take&rsquo; y recordando d&oacute;nde fue encontrado cada
objeto por primera vez, para as&iacute; agregarlo a la localidad correspondiente.<br>

N&oacute;tese que, en cualquier momento del mapeo autom&aacute;tico,
es posible acceder a la ventana de propiedades del mapeo autom&aacute;tico para as&iacute; cambiar las preferencias.<br>
    </p>
    <p id="HowDoesTheAutomapperDistinguishLocations" class="heading2">
      &iquest;C&oacute;mo hace el mapeo autom&aacute;tico para distinguir localidades?
    </p>
    <p>

      Como hemos mencionado el mapeo autom&aacute;tico leer&aacute; todo el texto de la transcripci&oacute;n del juego, tratando de encontrar las
descripciones de las localidades.  No s&oacute;lo las respuestas
a los comandos de movimiento.<br>
Esto se hace as&iacute; para que los comandos de teleportaci&oacute;n
(como las palabras m&aacute;gicas) o los eventos especiales que trasladan a tu
personaje funcionen correctamente. <br>

Las localidades son determinadas al encontrar el encabezado de las mismas (un texto donde todas las palabras de m&aacute;s de cuatro letras est&aacute;n
en may&uacute;sculas &ndash; al menos en el modo cl&aacute;sico&mdash;o donde el texto sigue el formato especificado, como el caso de <i>Witness</i>/<i>Moonmist</i>). <br>
      El p&aacute;rrafo que sigue al encabezado se asume que es la descripci&oacute;n del lugar.<br>
      Dependiendo de tus seteos, el mapeador autom&aacute;tico tomar&aacute; m&aacute;s en cuenta la descripci&oacute;n de la localidad o el encabezado
para determinar si cierta localidad ya ha sido visitada.<br>
      <br>
    </p>

    <p id="LimitationsOnAutomapping" class="heading2">
      Limitaciones del Mapeo Autom&aacute;tico
    </p>

<br>

Aunque el mapeo autom&aacute;tico es muy poderoso, tiene limitaciones que debes estar al tanto.<br>

Primeramente, funciona &oacute;ptimamente con juegos escritos en lenguaje Ingl&eacute;s.<br>

Segundo, deber&iacute;as intentar usar el mapeado autom&aacute;tico
con transcripciones hechas siempre en modo verborr&aacute;gico
(verbose). De ese modo, el mapeado autom&aacute;tico puede utilizar la descripci&oacute;n de la localidad para desambiguar una localidad de otra, en vez de utilizar s&oacute;lo el encabezado.<br>

Si tu juego est&aacute; en el modo normal o corto (brief),
el mapeado autom&aacute;tico podr&iacute;a confundirse e interpretar
una localidad ya visitada como una nueva localidad.<br>

Incluso en modo verborr&aacute;gico, el mapeo autom&aacute;tico
puede aun as&iacute; confundirse si la descripci&oacute;n de un lugar cambia dr&aacute;sticamente (como la casa demolida en <i>Hitchhiker's Guide
to the Galaxy</i>).<br>

El mapeo autom&aacute;tico tambi&eacute;n puede ser de no mucha ayuda en casos de laberintos donde todas las localidades poseen la misma descripci&oacute;n y encabezado o en casos donde las salidas se eligen al azar (caso <i>Adventure</i>/<i>Colossal Cave</i>).<br>

Algunos juegos no siguen las convenciones de Infocom de utilizar encabezados antes de describir la localidad (por ejemplo, <i>FailSafe</i>). Estos juegos no pueden mapearse en forma autom&aacute;tica.<br>
<br>
Finalmente, el algoritmo de posicionado de localidades utilizado en el mapeador autom&aacute;tico no es excepcional y puede dar a lugar a mapas con muchas rutas entrecruzadas o a localidades posicionadas en forma m&aacute;s
lejana de lo necesario.  Recuerde, sin embargo, que puedes ayudar al mapeador autom&aacute;tico manualmente moviendo o quitando localidades mientras est&aacute;s jugando el juego.<br>

Si por alg&uacute;n motivo el mapeador autom&aacute;tico no detecta
una localidad autom&aacute;ticamente, puedes tambi&eacute;n, en cualquier momento, manualmente agregar esa localidad y el mapeador autom&aacute;tico pasar&aacute; a tener conocimiento de ella. <br>

    <p id="ExportingToSVG" class="heading2">
      Exportando Mapas a Formato Scalable Vector Graphics (SVG)
      <img class="imagealignright" src="../images/svg_export.gif" width="338" height="603" alt="Cuadro de Opciones de IFMapper Grabar Mapa como SVG">
    </p>

    <p>
      Nuevo en v1.2 y mejorado en v2.1.0, una facilidad ha sido agregada
      para dejarte exportar mapas al formato de Scalable Vector Graphics (SVG)
      que puede ser impreso e interactuado usando un web browser.
      Cuando haya completado el mapa, cliquee en <b>Archivo-&gt;Exportar-&gt;Exportar Como <u>S</u>VG...</b> para abrir el panel de opciones de Grabar como SVG.<br>
	<br>
	Hay varias opciones disponibles para customizar la grabación, cada
	una con un tooltip que muestra más detalles cuando el cursor del ratón
	flota sobre él.  El primer set de checkboxes permutan las varias
	partes del map que son incluídas, como el Texto de Localidad, el Número
	de Localidad, los Commentarios de Sección, etc.<br>
	<br>
	El deslizador del tamaño de la Brújula te permite modificar el tamaño
	del gráfico de la brújula incluído en el SVG, o desactivarla completamente.  El Grosor de la Localidad y la Conexión cambian el tamaño de las líneas usadas para dibujar las cajas de la Localidad y las líneas de Conexión entre ellas, repectivamente, mientras que la opción del Esquema de Color modifica el color usado para algunos de los items opcionales, incluyendo el menu de Información Interactivo de la Localidad y el Número de la Localidad.<br>
	<br>
	Usted puede elegir entre exportar entre la opción por defecto de exportar todas las secciones del mapa a un solo archivo SVG, exportar todo el mapa a
	secciones de archivos SVG individuales o sólo exportar la sección activa a un archivo SVG.<br>
	<br>
	Esta última opción permite dos mas selecciones - si usted marca la opción de Solo Incluir los Elementos Seleccionados, entonces el archivo SVG
	tendrá solo esas localidades que han sido seleccionados en la ventana principal.  Esto te permite crear un mapa SVG parcial, que puede ser de ayuda a nuevos jugadores.<br>
	<br>
	La última opción - Incluir Todas Las Localidades, Sólo Mostrar el Texto de la Locación para Localidades Seleccionadas Actualmente- imprimirá un mapa
	con todas las localidades, pero sólo las localidades seleccionadas
	tendrán su Texto de Localidad incluído.  Similar a la opción previa,
	esto permite la creación de mapas parciales customizados que pueden ser
	usados como modelo por nuevos jugadores.  Sólo Conexiones que estén
	seleccionadas serán mostradas.<br>
	<br>
	Nota: sin importar que opciones estén seleccionadas, la localidad de
	comienzo - no. 1 - de un mapa será incluída.<br>
	<br>
	Una vez que haya especificado sus opciones preferidas, cliquée en el botón de <b><u>O</u>K</b>
	y especifique un archivo para grabar el formato SVG.<br>
	<br>
	Si usted abre el archivo SVG en un editor de texto y busca la palabra
	UNCOMMENT, encontrará un camino que puede ser descomentado asi:
	<br>
	<br>
	<code>&lt;!--UNCOMMENT LINE BELOW TO ENABLE mysvgmap.jpg BACKGROUND IMAGE--&gt;<br></code>
	<code>&lt;!--&lt;path d='M5,5 l0,<b>3570</b> l<b>2400</b>,0 l0,-3570 l-2400,0' fill='url(#backgroundimg)'/&gt;--&gt;</code><br>
	<br>
	Si usted descomenta esta línea (remueve los marcadores <code>&lt;!--</code> y <code>--&gt;</code> del comienzo y final del elemento de camino), re-graba
	el SVG y coloca un gráfico JPEG con el nombre del archivo listado en el comentario, e.g. <code>mysvgmap.jpg</code> en el extracto de ahí arriba,
	en el mismo directorio del archivo de SVG exportado, será usado
	como una imagen de fondo. Esto permite significante customización del
	mapa interactivo.  La imagen de fondo debería ser de las mismas
	dimensiones que el SVG - use los valores especificados en el elemento
	de camino.  height: <code>3570px</code> y width: <code>2400px</code>,
	en este ejemplo.  Si usted desea usar un archivo o formato de imagen
	diferente, simplemente reemplace ambas ocurrencias de el arhivo
	existente.
	e.j. <code>mysvgmap.jpg</code> to <code>mysvgmap.png</code>, en el
	archivo SVG.<br>
	<br>
    </p>

    <p id="CreatingANewInform/TADS3Game" class="heading2">
	Creando un Nuevo Juego (<i>Inform</i>/<i>TADS3</i>) game
    </p>

    <p>
      IFMapper ahora permite grabar un mapa como c&oacute;digo
      fuente de Inform o TADS3.<br>

      Esto significa que pod&eacute;s utilizar a IFMapper para f&aacute;cilmente crear el esqueleto b&aacute;sico para un nuevo juego. <br>

      Con IFMapper, pod&eacute;s colocar los objetos, los personajes y las localidades con sus puertas y salidas.
      Luego puedes escribir la descripci&oacute;n de cada localidad.<br>

      Para hacer esto, aseg&uacute;rate de activar el mostrar las descripciones de las localidades con:<br>
      <br>
      <b>Mapa-&gt;Representaci&oacute;n Visual-&gt;Descripci&oacute;n de la Localidad</b>
      <br>
      <br>
      Puedes luego escribir todas las descripciones de todas las habitaciones y
      sus objetos en forma manual. Luego, una vez que tu mapa est&aacute;
      terminado, pod&eacute;s usar:
      <br>
      <br>
      <b>Archivo-&gt;Exportar-&gt;Exportar a Inform</b><br>
      <b>Archivo-&gt;Exportar-&gt;Exportar a TADS3</b><br>
      <br>

      Estas opciones crear&aacute;n un grupo de archivos de c&oacute;digo fuente de Inform o TADS3 (un archivo por secci&oacute;n del mapa), que puedes compilar inmediamente y comenzar a jugar.<br>

      Obviamente, en un juego real, los archivos .inf o .t que obtienes de IFMapper son solo un esqueleto, ya que tendr&aacute;s que programar la l&oacute;gica de tu juego.
    </p>


    <p>&nbsp;</p>

    <p id="Appendix" class="heading1">
      Ap&eacute;ndices
    </p>


    <p id="IAmNewToInteractiveFiction.WhatGamesWouldYouRecommend?" class="heading2">
      Soy nuevo en esto de la Ficci&oacute;n Interactiva. &iquest;Qu&eacute; juegos me recomend&aacute;s?
    </p>


    Si habl&aacute;s ingles y pod&eacute;s obtener una copia (a trav&eacute;s de Lost Treasures of Infocom o similar), creo que Wishbringer de Infocom es probablemente uno de los juegos introductorias m&aacute;s lindos. <br>

Sus puzzles no son tan dif&iacute;ciles y son adem&aacute;s bastante l&oacute;gicos.<br>

Una vez que hayas ganado, pod&eacute;s probar con Planetfall, que tiene uno de los personajes m&aacute;s amado de cualquier juego de aventura.<br>

Asumiendo que no puedas obtener estos viejos juegos de Infocom,
City of Secrets de Emily Short es un muy lindo juego introductorio y una de las aventuras m&aacute;s pulidas que jam&aacute;s haya visto.<br>

Dreamholder de Andrew Plotkin es tambi&eacute;n un juego introductorio
que te ayuda con los comandos al comenzar el juego. N&oacute;tese, sin embargo, que los puzzles de ese juego no son f&aacute;ciles de resolver. <br>

    <p id="ContactingTheAuthor" class="heading2">
	Contactando al Autor
    </p>
    <p>
    Actualmente, se me puede contactar a trav&eacute;s de:<br>
    <br>
    <br>ggarra13 @ dominio<br>
    <br>
    (Donde el &quot;dominio&quot; es gmail.com )<br>
    </p>


</div>


</body>
</html>
